---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetPartialConvertFailureResults
source: html/fb8d7344-20ba-0b94-3fab-8855ebc76871.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.GetPartialConvertFailureResults Method

Gets the partial failure results.

## Syntax (C#)
```csharp
public IList<PartialFailureResults> GetPartialConvertFailureResults()
```

## Remarks
After the Convert method has been invoked and returned the DesignToFabricationConverterResult::Enum::PartialFailure, calls this method to get partial failure results.